TestCases/TopGather/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(   
    (0      0      0) 
    (0.02   0      0)
	(0.03   0      0)
	(0.04   0      0)
    (0      0.01   0) 
    (0.02   0.01   0)
	(0.03   0.01   0)
	(0.04   0.01   0)  
    (0      0.02   0) 
    (0.02   0.02   0)
	(0.03   0.03   0)
	(0.04   0.03   0) 
    (0      0      0.002) 
    (0.02   0      0.002)
	(0.03   0      0.002)
	(0.04   0      0.002)  
    (0      0.01   0.002) 
    (0.02   0.01   0.002)
	(0.03   0.01   0.002)
	(0.04   0.01   0.002)  
    (0      0.02   0.002) 
    (0.02   0.02   0.002)
	(0.03   0.03   0.002)
	(0.04   0.03   0.002) 
);

blocks
(
    hex (0 1 5 4 12 13 17 16)   (10 5 1)  simpleGrading (1 1 1)
    hex (1 2 6 5 13 14 18 17)   (5 5 1)   simpleGrading (1 1 1)
    hex (2 3 7 6 14 15 19 18)   (5 5 1)   simpleGrading (1 1 1)
    hex (4 5 9 8 16 17 21 20)   (10 5 1)  simpleGrading (1 1 1)
    hex (6 7 11 10 18 19 23 22) (5 10 1)  simpleGrading (1 1 1)     
);

edges
(
);

boundary
(
    Walls
    {
        type wall;
        faces
        (
            (0 12 16 4)
            (4 16 20 8)
            (8 9 21 20)
            (5 17 21 9)
            (5 6 18 17)
            (6 18 22 10)
            (7 19 23 11)
            (3 15 19 7)
            (0 1 13 12)
            (1 2 14 13)
            (2 3 15 14)   
        );
    }
    

    atmosphere
    {
        type patch;
        faces
        (
            (10 11 23 22)
        );
    }
	
);

mergePatchPairs
(
);

// ************************************************************************* //
