TestCases/TopGather/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    {
        name    s1;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
	    {
       	    patch     "Walls";
    	}
    }

    {
        name    s1;
        type    faceSet;
        action  subset;
        source  boxToFace;    
        sourceInfo
	    {
           
           box (0.005 0 0) (0.015 0.006 0.002);
      
    	}
    }

);

// ************************************************************************* //
